VEA-SRL/IRUINO_Library/boards.txt
menu.UploadSpeed=Upload Speed
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

iruino.name=Iruino VEA

iruino.upload.tool=esptool_py
iruino.upload.maximum_size=1310720
iruino.upload.maximum_data_size=327680
iruino.upload.wait_for_upload_port=true

iruino.serial.disableDTR=true
iruino.serial.disableRTS=true

iruino.build.mcu=esp32
iruino.build.core=esp32
iruino.build.variant=iruino
iruino.build.board=Iruino

iruino.build.f_cpu=240000000L
iruino.build.flash_size=4MB
iruino.build.flash_freq=40m
iruino.build.flash_mode=dio
iruino.build.boot=dio
iruino.build.partitions=default
iruino.build.defines=



iruino.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
iruino.menu.PartitionScheme.default.build.partitions=default
iruino.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
iruino.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
iruino.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
iruino.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
iruino.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
iruino.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
iruino.menu.PartitionScheme.minimal.build.partitions=minimal
iruino.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
iruino.menu.PartitionScheme.no_ota.build.partitions=no_ota
iruino.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
iruino.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
iruino.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
iruino.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
iruino.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
iruino.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
iruino.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
iruino.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
iruino.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
iruino.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
iruino.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
iruino.menu.PartitionScheme.huge_app.build.partitions=huge_app
iruino.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
iruino.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
iruino.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
iruino.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
iruino.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
iruino.menu.PartitionScheme.fatflash.build.partitions=ffat
iruino.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
iruino.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
iruino.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
iruino.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728



iruino.menu.UploadSpeed.921600=921600
iruino.menu.UploadSpeed.921600.upload.speed=921600
iruino.menu.UploadSpeed.115200=115200
iruino.menu.UploadSpeed.115200.upload.speed=115200
iruino.menu.UploadSpeed.256000.windows=256000
iruino.menu.UploadSpeed.256000.upload.speed=256000
iruino.menu.UploadSpeed.230400.windows.upload.speed=256000
iruino.menu.UploadSpeed.230400=230400
iruino.menu.UploadSpeed.230400.upload.speed=230400
iruino.menu.UploadSpeed.460800.linux=460800
iruino.menu.UploadSpeed.460800.macosx=460800
iruino.menu.UploadSpeed.460800.upload.speed=460800
iruino.iruino.UploadSpeed.512000.windows=512000
iruino.menu.UploadSpeed.512000.upload.speed=512000

